docs/flow diagrams/api/search-api.puml
@startuml Search (All/specific resource)
Client -> FhirServer : GET
FhirServer -> Middleware
Middleware -> FhirController
FhirController -> Mediatr : Search Resource
Mediatr -> SearchResourceHandler : SearchResourceRequest
SearchResourceHandler -> AuthorizationService : CheckAccess
AuthorizationService -> SearchResourceHandler
SearchResourceHandler -> SearchService : Search by ResourceType, queries
SearchService -> SearchOptionsFactory : Create SearchOptions
SearchOptionsFactory -> SearchService
SearchService -> SearchInternalAsync : Data store dependent
SearchInternalAsync -> SearchService : SearchResult
SearchService -> SearchResourceHandler : SearchResult
SearchResourceHandler -> Mediatr : SearchResourceResponse
Mediatr -> FhirController : ResourceElement
FhirController -> Middleware : FhirResult
Middleware -> FhirServer
FhirServer -> Client
@enduml
